schemas/src/main/resources/ogc/sos/2.0/examples/transactional/InsertSensor1.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--=====================================================================
Example Request for InsertSensor operation which contains information about the description format as well as the format of the procedure description. Additionally, the identifier of the property observed by this sensor is returned. The response contains the assigned sensor ID.
=======================================================================-->
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd
http://www.opengis.net/swes/2.0 http://schemas.opengis.net/swes/2.0/swes.xsd  http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd" xmlns:sos="http://www.opengis.net/sos/2.0" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:sml="http://www.opengis.net/sensorML/1.0.1" xmlns:swe="http://www.opengis.net/swe/2.0" xmlns:swes="http://www.opengis.net/swes/2.0" xmlns:fes="http://www.opengis.net/fes/2.0" xmlns:gml="http://www.opengis.net/gml/3.2" xmlns:ogc="http://www.opengis.net/ogc" xmlns:om="http://www.opengis.net/om/2.0" xmlns:xlink="http://www.w3.org/1999/xlink">
	<soap12:Header>
		<wsa:To>http://www.ogc.org/SOS</wsa:To>
		<wsa:Action>http://www.opengis.net/swes/2.0/InsertSensor</wsa:Action>
		<wsa:ReplyTo>
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:MessageID>http://my.client.com/uid/msg-0010</wsa:MessageID>
	</soap12:Header>
	<soap12:Body>
		<swes:InsertSensor service="SOS" version="2.0.0">
	<!--format of the sensor description-->
	<swes:procedureDescriptionFormat>http://www.opengis.net/sensorML/1.0.1</swes:procedureDescriptionFormat>
	<!--sensor description encoded in SensorML 1.0.1; for more information take a look at the examples of the SensorML specification-->
	<swes:procedureDescription>	
		<!--- sensor description here-->
		<sml:SensorML/>
	</swes:procedureDescription>
	<swes:observableProperty>http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#WaterHeight</swes:observableProperty>
	<swes:metadata>
	<sos:SosInsertionMetadata>
		<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement</sos:observationType>
		<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Observation</sos:observationType>
		<sos:featureOfInterestType>http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint</sos:featureOfInterestType>
	</sos:SosInsertionMetadata>
	</swes:metadata>
</swes:InsertSensor>
</soap12:Body>
</soap12:Envelope>