52n-sos-webapp/src/main/webapp/static/examples/sos_v20/requests_soap/Transactional/InsertSensor.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
	xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd">
	<env:Body>
		<swes:InsertSensor service="SOS" version="2.0.0"
			xmlns:swes="http://www.opengis.net/swes/2.0" 
			xmlns:sos="http://www.opengis.net/sos/2.0" 
			xmlns:swe="http://www.opengis.net/swe/1.0.1"
			xmlns:sml="http://www.opengis.net/sensorML/1.0.1" 
			xmlns:gml="http://www.opengis.net/gml" 
			xmlns:xlink="http://www.w3.org/1999/xlink"
			xsi:schemaLocation="http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sosInsertSensor.xsd 
			http://www.opengis.net/swes/2.0 http://schemas.opengis.net/swes/2.0/swes.xsd">
			<swes:procedureDescriptionFormat>http://www.opengis.net/sensorML/1.0.1</swes:procedureDescriptionFormat>
			<swes:procedureDescription>	
				<sml:SensorML version="1.0.1">
					<sml:member>
						<sml:System>
							
							<!-- optional; generated if not present -->
							<sml:identification>
								<sml:IdentifierList>
									<sml:identifier name="uniqueID">
										<sml:Term definition="urn:ogc:def:identifier:OGC:uniqueID">
											<sml:value>http://www.example.org/sensors/106</sml:value>
										</sml:Term>
									</sml:identifier>
								</sml:IdentifierList>
							</sml:identification>

							<!-- optional; generated if not present -->
							<sml:identification xlink:title="offerings">
								<sml:IdentifierList>
									<sml:identifier name="Offering for sensor 106">
										<sml:Term definition="urn:ogc:def:identifier:OGC:offeringID">
											<sml:value>http://www.example.org/sensors/106/observations</sml:value>
										</sml:Term>
									</sml:identifier>
								</sml:IdentifierList>
							</sml:identification>
							<sml:capabilities name="parentProcedures">
								<swe:SimpleDataRecord>
									<gml:metaDataProperty xlink:title="http://www.my_namespace.org/sensors/1821241365" xlink:href="http://localhost:8080/52nSOSv4.0.0/kvp?request=DescribeSensor&amp;service=SOS&amp;version=2.0.0&amp;procedure=http://www.example.org/sensors/101&amp;procedureDescriptionFormat=http%3A%2F%2Fwww.opengis.net%2FsensorML%2F1.0.1"/>
								</swe:SimpleDataRecord>
							</sml:capabilities>
							<sml:capabilities name="featureOfInterest">
								<swe:SimpleDataRecord>
									<swe:field name="FeatureOfInterestID">
										<swe:Text definition="FeatureOfInterest identifier">
											<swe:value>test_feature_6</swe:value>
										</swe:Text>
									</swe:field>
								</swe:SimpleDataRecord>
							</sml:capabilities>
							<sml:position name="sensorPosition">
								<swe:Position referenceFrame="urn:ogc:def:crs:EPSG::4326">
									<swe:location>
										<swe:Vector gml:id="STATION_LOCATION">
											<swe:coordinate name="easting">
												<swe:Quantity axisID="x">
													<swe:uom code="degree"/>
													<swe:value>7.727958</swe:value>
												</swe:Quantity>
											</swe:coordinate>
											<swe:coordinate name="northing">
												<swe:Quantity axisID="y">
													<swe:uom code="degree"/>
													<swe:value>51.883906</swe:value>
												</swe:Quantity>
											</swe:coordinate>
											<swe:coordinate name="altitude">
												<swe:Quantity axisID="z">
													<swe:uom code="m"/>
													<swe:value>52.0</swe:value>
												</swe:Quantity>
											</swe:coordinate>
										</swe:Vector>
									</swe:location>
								</swe:Position>
							</sml:position>
							<sml:inputs>
								<sml:InputList>
									<sml:input name="test_observable_property_6">
										<swe:ObservableProperty definition="test_observable_property_6"/>
									</sml:input>
								</sml:InputList>
							</sml:inputs>
							<sml:outputs>
								<sml:OutputList>
									<sml:output name="test_observable_property_6">
										<swe:Quantity definition="test_observable_property_6">
											<swe:uom code="NOT_DEFINED"/>
										</swe:Quantity>
									</sml:output>
								</sml:OutputList>
							</sml:outputs>
							<sml:components>
								<sml:ComponentList>
									<sml:component name="component1" xlink:title="http://www.example.org/sensors/106#c1" xlink:role="childProcedure">
										<sml:System>
											<!-- optional; generated if not present -->
											<sml:identification>
												<sml:IdentifierList>
													<sml:identifier name="uniqueID">
														<sml:Term definition="urn:ogc:def:identifier:OGC:uniqueID">
															<sml:value>http://www.example.org/sensors/106#c1</sml:value>
														</sml:Term>
													</sml:identifier>
												</sml:IdentifierList>
											</sml:identification>
											<sml:position name="sensorPosition">
												<swe:Position referenceFrame="urn:ogc:def:crs:EPSG::4326">
													<swe:location>
														<swe:Vector gml:id="STATION_LOCATION_2">
															<swe:coordinate name="easting">
																<swe:Quantity axisID="x">
																	<swe:uom code="degree"/>
																	<swe:value>7.727958</swe:value>
																</swe:Quantity>
															</swe:coordinate>
															<swe:coordinate name="northing">
																<swe:Quantity axisID="y">
																	<swe:uom code="degree"/>
																	<swe:value>51.883906</swe:value>
																</swe:Quantity>
															</swe:coordinate>
															<swe:coordinate name="altitude">
																<swe:Quantity axisID="z">
																	<swe:uom code="m"/>
																	<swe:value>52.0</swe:value>
																</swe:Quantity>
															</swe:coordinate>
														</swe:Vector>
													</swe:location>
												</swe:Position>
											</sml:position>
											<sml:inputs>
												<sml:InputList>
													<sml:input name="test_observable_property_6">
														<swe:ObservableProperty definition="test_observable_property_6"/>
													</sml:input>
												</sml:InputList>
											</sml:inputs>
											<sml:outputs>
												<sml:OutputList>
													<sml:output name="test_observable_property_6">
														<swe:Quantity definition="test_observable_property_6">
															<swe:uom code="NOT_DEFINED"/>
														</swe:Quantity>
													</sml:output>
												</sml:OutputList>
											</sml:outputs>
										</sml:System>
									</sml:component>
								</sml:ComponentList>
							</sml:components>
						</sml:System>
					</sml:member>
				</sml:SensorML>			
			</swes:procedureDescription>
			<!-- multiple values possible -->
			<swes:observableProperty>test_observable_property_6#1</swes:observableProperty>
			<swes:observableProperty>test_observable_property_6#2</swes:observableProperty>
			<swes:observableProperty>test_observable_property_6#3</swes:observableProperty>
			<swes:observableProperty>test_observable_property_6#4</swes:observableProperty>
			<swes:observableProperty>test_observable_property_6#5</swes:observableProperty>
			<swes:metadata>
				<sos:SosInsertionMetadata>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_Measurement</sos:observationType>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_CategoryObservation</sos:observationType>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_CountObservation</sos:observationType>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_TextObservation</sos:observationType>
					<sos:observationType>http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_TruthObservation</sos:observationType>
					<!-- multiple values possible -->
					<sos:featureOfInterestType>http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint</sos:featureOfInterestType>
				</sos:SosInsertionMetadata>
			</swes:metadata>
		</swes:InsertSensor>
	</env:Body>
</env:Envelope>
